{
  "Introduction": [
    "Subject to these Terms of Service (“Terms”, “Terms of Service”), 'SMART Crack', ('we', 'us', and/or 'our') provides access to SMART Crack's application as a service (collectively, the 'Services'). By using or accessing the Services, you acknowledge that you have read, understood, and agree to be bound by this Agreement.",
    "These Terms of Service govern your use of our web pages located at https://smartcrack.com.",
    "Our Privacy Policy also governs your use of our Service and explains how we collect, safeguard, and disclose information that results from your use of our web pages. Please read it here: https://smartcrack.com/legal/privacy.",
    "Your agreement with us includes these Terms and our Privacy Policy (“Agreements”). You acknowledge that you have read and understood Agreements, and agree to be bound by them.",
    "If you do not agree with (or cannot comply with) Agreements, you may not use the Service. These Terms apply to all visitors, users, and others who wish to access or use the Service.",
    "Thank you for being responsible and for using SMART Crack!"
  ],
  "Communications": [
    "SMART Crack does not require account creation or any personal information to use the service. Any communication or updates will be available directly on the website."
  ],
  "Purchases": [
    "SMART Crack is a completely free tool. There are no purchases, payments, or fees required to use any of its features."
  ],
  "Subscriptions": [
    "SMART Crack does not have any subscriptions or recurring plans. All features are accessible to everyone for free without restrictions."
  ],
  "Free Trial": [
    "There are no free trials for SMART Crack as all features are provided completely free of charge without any time limits or hidden fees."
  ],
  "Fee Changes": [
    "SMART Crack is entirely free to use. There are no subscription fees or charges, so no fee changes will ever apply."
  ],
  "Refunds": [
    "As SMART Crack does not charge any fees, refunds are not applicable."
  ],
  "Content": [
    "Our Service allows you to upload, visualize, and interact with your Rust-based smart contract data. You are solely responsible for ensuring that the content you use on our platform is lawful and does not infringe on the rights of others.",
    "By using our Service, you grant us a temporary license to process your data for visualization purposes. However, your data is not stored on our servers and is processed only locally within your browser. Once you leave the Service, your data is no longer accessible to SMART Crack."
  ],
  "Prohibited Uses": [
    "You may use SMART Crack only for lawful purposes and in accordance with these Terms. You agree not to use the Service:",
    "• In any way that violates applicable national or international laws or regulations.",
    "• To upload malicious files, such as viruses, worms, or trojans.",
    "• To harm, exploit, or attempt to exploit other users or their data.",
    "• To reverse-engineer or misuse the Service for unauthorized purposes.",
    "• To interfere with or disrupt the proper operation of the Service."
  ],
  "Analytics": [
    "SMART Crack does not track your activity or use any analytics services. All processing happens locally in your browser, ensuring your privacy."
  ],
  "Account": [
    "SMART Crack does not require you to create an account or provide any personal details to use the Service. You can access all features anonymously without any hassle."
  ],
  "Data Encryption and Storage": [
    "SMART Crack processes your data entirely locally in your browser and does not transmit it to any server. Your data remains private and is not stored or accessible after you leave the Service.",
    "As your data is processed on your device, it is your responsibility to ensure its security. SMART Crack is not liable for any loss or misuse of your data."
  ],
  "Intellectual Property": [
    "Service and its original content (excluding content provided by users), features, and functionality are and will remain the exclusive property of SMART Crack and its licensors. Service is protected by copyright and other intellectual property laws. You may not use, modify, or distribute Service content without our prior written consent."
  ],
  "Error Reporting & Feedback": [
    "We encourage you to provide feedback or report issues with the Service by contacting us at contact@smartcrack.com. By providing feedback, you agree that we may use it to improve the Service without any obligation or compensation to you."
  ],
  "Disclaimer of Warranty": [
    "SMART Crack IS PROVIDED 'AS IS' AND 'AS AVAILABLE' WITHOUT ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.",
    "We do not guarantee that the Service will be error-free, uninterrupted, or compatible with every device or browser. Use the Service at your own risk."
  ],
  "Limitation of Liability": [
    "SMART Crack SHALL NOT BE LIABLE FOR ANY INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR RELATED TO YOUR USE OF THE SERVICE. THIS INCLUDES, BUT IS NOT LIMITED TO, DAMAGES FOR LOSS OF DATA OR PROFITS, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.",
    "SMART Crack’s total liability under any circumstances shall not exceed $0, as the Service is provided free of charge."
  ],
  "Termination": [
    "We reserve the right to terminate or restrict access to the Service at any time for any reason, without notice."
  ],
  "Changes To Service": [
    "SMART Crack reserves the right to modify or discontinue the Service at any time without notice. We will not be liable for any interruptions or changes to the Service."
  ],
  "Amendments To Terms": [
    "We may update these Terms from time to time. Any changes will be posted on this page, and your continued use of the Service constitutes your acceptance of the updated Terms."
  ],
  "Acknowledgement": [
    "BY USING SMART Crack, YOU ACKNOWLEDGE THAT YOU HAVE READ THESE TERMS AND AGREE TO BE BOUND BY THEM."
  ],
  "Contact Us": [
    "If you have any questions about these Terms, please contact us:",
    "By email: contact@smartcrack.com."
  ]
}
